{"config": [{"config": {"return_sequences": false, "trainable": true, "return_state": false, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "name": "lstm_1", "go_backwards": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 16, "batch_input_shape": [null, 20, 1], "dtype": "float32", "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "stateful": false, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "activation": "tanh", "unit_forget_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8"}