{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unroll": false, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "use_bias": true, "dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "return_sequences": false, "kernel_regularizer": null, "units": 8, "implementation": 0, "stateful": false, "recurrent_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "trainable": true, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "batch_input_shape": [null, 20, 1], "name": "lstm_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 1, "name": "dense_1"}}], "keras_version": "2.0.8", "backend": "tensorflow"}